# 一面


1. 自我介绍。
1. 你参加了这么多比赛，你觉得在比赛中你取得这些成绩的主要因素是啥？
1. 项目(深扣细节)。
1. 堆和栈的区别？什么场景下会出现栈溢出？因为我回答了递归这一种情况，面试官追问函数递归一定会出现栈溢出吗？
1. 手撕代码。(实现strcpy，核心代码)
手撕提的问题:
a. 你觉得判断指针异常可以怎么改进？
b. 如果传入的指针不是char型，而是float型，你怎么判断？
c. 我主动提出缓冲区是否足够拷贝对应的字符串异常需要进一步判断，面试官表示懂我意思了。
1. 反问



# 二面


1. 自我介绍。
1. 项目(继续抠)，打断我，问我SDN是不是软件定义网络。
1. 面试官问:你认识朱x清(一本书的作者)，那个是我朋友，我说我读了他的《xxx》书，认识。
1. 开放问题:你知道断点调试怎么实现的吗？没有标准答案，做一个探讨。
探讨过程多出的问题:
a. 你用while 循环打印断点，那你是如何把while加到指定位置的？
b. 不能用进程间的通信来实现加代码，还有没有别的办法？
1. 假设char数组长度10，如果我访问第20个元素，会出现什么问题？
探讨出的问题:
a. 一定会出现段错误吗？
b. 假设编译器平台是xx，会出现什么结果或现象？
1. 场景题:我家的网卡10G，腾讯服务器100G，为什么网速维持在10MB/S？它是怎么实现的？
1. 反问



# HR面


1. 自我介绍
1. 对工作地点的看法？
1. 你觉得导师是个什么类型的人？
1. 如果需要外派国外，你的看法是啥？
1. 参加华为数模的时候你们比赛的过程？
1. 你在工作时，薪资，地点和爱好，你怎么排序的？
1. 你父母对你找工作的态度？或者他们对你价值观影响比较大的是什么？
1. 你研究生两年或者七年来，比较难熬的时候是什么？
1. 当你和你同事发生分歧或者冲突，你会怎么解决？
1. 你对工作城市的选择，会介意去一线城市吗？
1. 周围人对你的评价是啥？
1. 你觉得你对工作内容的期望是什么？
1. 你对未来有没有一个期望或者是规划？
1. 你有没有情绪比较失落的时候？
1. 你面前找工作面了几家公司？
1. 为什么选择oppo？
1. 你之前了解过oppo吗？都是怎么了解到的？
1. 你觉得团队做项目过程中什么比较重要？
1. …… (问题实在太多了，容我慢慢想了再补充，总的来说，都是旁敲侧击问你是个什么样的人)
1. 反问
